$(function () {
    $('#header').load('./header.html', function () {
        $('.menuBtn').click(function () {
            $('.menuList').slideDown(500)
        });

        $('.menuList .oper img').click(function () {
            $('.menuList').slideUp(300)
        })
    });
    $('#footer').load('./footer.html');

    var list = {

        salad= {
            'id': 'nav-salad',
            'href': '#nav-salad',
            'data': {
                'id': '#pills-01',
                'name': '秘制黑椒牛肉增肌餐',
                'img': './images/salad/01.jpg',
                'data': [
                    ['秘制黑椒牛肉增肌餐', 310, 0, 0, 2, 2, 3, 1, 195.10, 23.61, 4.52, 14.00],
                    ['生菜基底', 90, 'V', '蔬菜', 0, 0, 1, 0, 14.40, 1.35, 0.36, 1.26],
                    ['玉米粒', 25, 'G', 谷薯, 0, 1, 0, 0, 28.00, 4.98, 0.30, 1.00],
                    [圣女果, 30, V, 蔬菜, 0, 0, 1, 0, 6.60, 1.20, 0.06, 0.30],
                    [鸡蛋, 30, P, 蛋白质, 1, 0, 0, 0, 43.20, 0.84, 2.64, 3.99],
                    [西兰花, 25, V, 蔬菜, 0, 0, 1, 0, 9.00, 0.68, 0.15, 1.03],
                    [甜橙, 40, F, 水果, 0, 0, 0, 1, 19.20, 4.20, 0.08, 0.32],
                    [红薯, 40, G, 谷薯, 0, 1, 0, 0, 40.80, 9.24, 0.08, 0.44],
                    [牛肉, 30, P, 蛋白质, 1, 0, 0, 0, 33.90, 1.13, 0.85, 5.66]
                ]
            }
        }

    };
});